app/controllers/api/v1/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def random_greetings
    message = Message.order("RANDOM()").first